In [ ]:
# Q1. Problem Statement: Conditional Probability
# Load the “kerala.csv” data into a DataFrame and perform the following tasks:
# 1. Explore the DataFrame using info() and describe() functions
# 2. June and July are the peak months of rainfall. Consider that if it rains more
# than 500mm, then the chances of flood become more; create a Datarame
# with columns –“YEAR”, “JUN_GT_500” (Contains a boolean value to show
# whether it rained more than 500 mm in June), “JUL_GT_500” (Contains a
# boolean value to show whether it rained more than 500 mm in July), and
# “FLOODS” (Contains a boolean value to show whether it flooded that year)
# 3. Calculate the probability of flood given it rained more than 500 mm in June
# (P(A|B))
# 4. Calculate the probability of rain more than 500 mm in June, given it flooded
# that year (P(B|A))
# 5. Probability of flood given it rained more than 500 mm in July
# 6. Probability of rain of more than 500 mm in July given it flooded that year
# (P(B|A))

In [29]:
import pandas as pd
data = pd.read_csv('kerala.csv')
data.head()

,SUBDIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL,FLOODS
0,KERALA,1901,28.7,44.7,51.6,160.0,174.7,824.6,743.0,357.5,197.7,266.9,350.8,48.4,3248.6,YES
1,KERALA,1902,6.7,2.6,57.3,83.9,134.5,390.9,1205.0,315.8,491.6,358.4,158.3,121.5,3326.6,YES
2,KERALA,1903,3.2,18.6,3.1,83.6,249.7,558.6,1022.5,420.2,341.8,354.1,157.0,59.0,3271.2,YES
3,KERALA,1904,23.7,3.0,32.2,71.5,235.7,1098.2,725.5,351.8,222.7,328.1,33.9,3.3,3129.7,YES
4,KERALA,1905,1.2,22.3,9.4,105.9,263.3,850.2,520.5,293.6,217.2,383.5,74.4,0.2,2741.6,NO

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118 entries, 0 to 117
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   SUBDIVISION       118 non-null    object
 1   YEAR              118 non-null    int64
 2   JAN               118 non-null    float64
 3   FEB               118 non-null    float64
 4   MAR               118 non-null    float64
 5   APR               118 non-null    float64
 6   MAY               118 non-null    float64
 7   JUN               118 non-null    float64
 8   JUL               118 non-null    float64
 9   AUG               118 non-null    float64
 10  SEP               118 non-null    float64
 11  OCT               118 non-null    float64
 12  NOV               118 non-null    float64
 13  DEC               118 non-null    float64
 14   ANNUAL RAINFALL  118 non-null    float64
 15  FLOODS            118 non-null    object
dtypes: float64(13), int64(1), object(2)
memory usage: 14.9+ KB

In [7]:
data.describe()

,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL
count,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000
mean,1959.500000,12.218644,15.633898,36.670339,110.330508,228.644915,651.617797,698.220339,430.369492,246.207627,293.207627,162.311017,40.009322,2925.405085
std,34.207699,15.473766,16.406290,30.063862,44.633452,147.548778,186.181363,228.988966,181.980463,121.901131,93.705253,83.200485,36.676330,452.169407
min,1901.000000,0.000000,0.000000,0.100000,13.100000,53.400000,196.800000,167.500000,178.600000,41.300000,68.500000,31.500000,0.100000,2068.800000
25%,1930.250000,2.175000,4.700000,18.100000,74.350000,125.050000,535.550000,533.200000,316.725000,155.425000,222.125000,93.025000,10.350000,2613.525000
50%,1959.500000,5.800000,8.350000,28.400000,110.400000,184.600000,625.600000,691.650000,386.250000,223.550000,284.300000,152.450000,31.100000,2934.300000
75%,1988.750000,18.175000,21.400000,49.825000,136.450000,264.875000,786.975000,832.425000,500.100000,334.500000,355.150000,218.325000,54.025000,3170.400000
max,2018.000000,83.500000,79.000000,217.200000,238.000000,738.800000,1098.200000,1526.500000,1398.900000,526.700000,567.900000,365.600000,202.300000,4473.000000

In [9]:
data.isnull().any()

SUBDIVISION         False
YEAR                False
JAN                 False
FEB                 False
MAR                 False
APR                 False
MAY                 False
JUN                 False
JUL                 False
AUG                 False
SEP                 False
OCT                 False
NOV                 False
DEC                 False
 ANNUAL RAINFALL    False
FLOODS              False
dtype: bool

In [ ]:
# 2. June and July are the peak months of rainfall. Consider that if it rains more
# than 500mm, then the chances of flood become more; create a Datarame
# with columns –“YEAR”, “JUN_GT_500” (Contains a boolean value to show
# whether it rained more than 500 mm in June), “JUL_GT_500” (Contains a
# boolean value to show whether it rained more than 500 mm in July), and
# “FLOODS” (Contains a boolean value to show whether it flooded that year)

In [31]:
data['JUN_GT_500'] = (data['JUN']>500).astype('bool')
data['JUL_GT_500'] = (data['JUL']>500).astype('bool')

data["FLOODS"] = data['FLOODS'].map({"YES":True, "NO":False})
data.head()

,SUBDIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL,FLOODS,JUN_GT_500,JUL_GT_500
0,KERALA,1901,28.7,44.7,51.6,160.0,174.7,824.6,743.0,357.5,197.7,266.9,350.8,48.4,3248.6,True,True,True
1,KERALA,1902,6.7,2.6,57.3,83.9,134.5,390.9,1205.0,315.8,491.6,358.4,158.3,121.5,3326.6,True,False,True
2,KERALA,1903,3.2,18.6,3.1,83.6,249.7,558.6,1022.5,420.2,341.8,354.1,157.0,59.0,3271.2,True,True,True
3,KERALA,1904,23.7,3.0,32.2,71.5,235.7,1098.2,725.5,351.8,222.7,328.1,33.9,3.3,3129.7,True,True,True
4,KERALA,1905,1.2,22.3,9.4,105.9,263.3,850.2,520.5,293.6,217.2,383.5,74.4,0.2,2741.6,False,True,True

In [41]:
data2 = data.loc[:,["YEAR", "JUN_GT_500", "JUL_GT_500", "FLOODS"]]
data2

     YEAR  JUN_GT_500  JUL_GT_500  FLOODS
0    1901        True        True    True
1    1902       False        True    True
2    1903        True        True    True
3    1904        True        True    True
4    1905        True        True   False
..    ...         ...         ...     ...
113  2014       False        True    True
114  2015        True       False   False
115  2016        True       False   False
116  2017       False       False   False
117  2018        True        True    True

[118 rows x 4 columns]

In [43]:
pd.crosstab(data2["JUN_GT_500"], data2["FLOODS"], margins = True, margins_name = "Total")

FLOODS      False  True  Total
JUN_GT_500
False          19     6     25
True           39    54     93
Total          58    60    118

In [45]:
# 3. Calculate the probability of flood given it rained more than 500 mm in June (P(A|B))

p_j500 = 93/118
p_j500

0.788135593220339

In [47]:
p_floodANDj500 = 54/118
p_floodANDj500

0.4576271186440678

In [ ]:
p_j500NOT = 25/118
p_j500NOT

In [49]:
p_floodANDj500NOT = 6/118
p_floodANDj500NOT

0.05084745762711865

In [51]:
p_floodGIVENj500 = p_floodANDj500/p_j500
p_floodGIVENj500

0.5806451612903226

In [53]:
# 4. Calculate the probability of rain more than 500 mm in June, given it flooded that year (P(B|A))

p_flood = 60/118
p_flood

0.5084745762711864

In [55]:
P_j500ANDflood = 54/118
P_j500ANDflood

0.4576271186440678

In [57]:
p_j500GIVENflood = P_j500ANDflood/p_flood
p_j500GIVENflood

0.9

In [63]:
# 5. Probability of flood given it rained more than 500 mm in July

pd.crosstab(data['JUL_GT_500'],data["FLOODS"], margins=True, margins_name='Total')

FLOODS      False  True  Total
JUL_GT_500
False          19     3     22
True           39    57     96
Total          58    60    118

In [65]:
p_jl500 = 96/118
p_jl500

0.8135593220338984

In [67]:
p_floodANDjl500 = 57/118
p_floodANDjl500

0.4830508474576271

In [69]:
p_floodGIVENjl500 = p_floodANDjl500/p_jl500
p_floodGIVENjl500

0.59375

In [71]:
# 6. Probability of rain of more than 500 mm in July given it flooded that year (P(B|A))  ----Bayes Theorem

p_jl500NOT = 22/118
p_jl500NOT

0.1864406779661017

In [73]:
p_floodANDjl500NOT = 3/118
p_floodANDjl500NOT

0.025423728813559324

In [77]:
p_floodGIVENjl500not = p_floodANDjl500NOT/p_jl500NOT
p_floodGIVENjl500not

0.13636363636363638

In [81]:
p_bayes = p_jl500*p_floodGIVENjl500/(p_jl500*p_floodGIVENjl500+p_jl500NOT*p_floodGIVENjl500not)
p_bayes

0.95